test/cassettes/billing/create_checkout_session.json

{
  "interactions": [
    {
      "recorded_at": "2026-04-06T16:03:05.204093Z",
      "request": {
        "body": "name=Checkout+Test+Product&type=service",
        "body_type": "text",
        "headers": {
          "accept-encoding": [
            "gzip"
          ],
          "content-type": [
            "application/x-www-form-urlencoded"
          ],
          "user-agent": [
            "req/0.5.17"
          ]
        },
        "method": "POST",
        "query_string": "",
        "uri": "https://api.stripe.com/v1/products"
      },
      "response": {
        "body_json": {
          "active": true,
          "attributes": [],
          "created": 1775491385,
          "default_price": null,
          "description": null,
          "id": "prod_UHpGo8INwka9QU",
          "images": [],
          "livemode": false,
          "marketing_features": [],
          "metadata": {},
          "name": "Checkout Test Product",
          "object": "product",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "tax_details": null,
          "type": "service",
          "unit_label": null,
          "updated": 1775491385,
          "url": null
        },
        "body_type": "json",
        "headers": {
          "access-control-allow-credentials": [
            "true"
          ],
          "access-control-allow-methods": [
            "GET, HEAD, PUT, PATCH, POST, DELETE"
          ],
          "access-control-allow-origin": [
            "*"
          ],
          "access-control-expose-headers": [
            "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
          ],
          "access-control-max-age": [
            "300"
          ],
          "cache-control": [
            "no-cache, no-store"
          ],
          "connection": [
            "keep-alive"
          ],
          "content-security-policy": [
            "base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src 'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD"
          ],
          "content-type": [
            "application/json"
          ],
          "date": [
            "Mon, 06 Apr 2026 16:03:05 GMT"
          ],
          "idempotency-key": [
            "ebb76c14-36e2-41b9-a09d-bb70410c52c0"
          ],
          "original-request": [
            "req_4oiko6FGA0abIb"
          ],
          "report-to": [
            "{\"group\":\"csp\",\"max_age\":8640,\"endpoints\":[{\"url\":\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\"}],\"include_subdomains\":true}"
          ],
          "reporting-endpoints": [
            "csp=\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\""
          ],
          "request-id": [
            "req_4oiko6FGA0abIb"
          ],
          "server": [
            "nginx"
          ],
          "strict-transport-security": [
            "max-age=63072000; includeSubDomains; preload"
          ],
          "stripe-should-retry": [
            "false"
          ],
          "stripe-version": [
            "2026-02-25.clover"
          ],
          "vary": [
            "Origin"
          ],
          "x-stripe-priority-routing-enabled": [
            "true"
          ],
          "x-stripe-routing-context-priority-tier": [
            "api-testmode"
          ],
          "x-wc": [
            "3c3"
          ]
        },
        "status": 200
      }
    },
    {
      "recorded_at": "2026-04-06T16:03:05.460840Z",
      "request": {
        "body": "currency=usd&product=prod_UHpGo8INwka9QU&recurring%5Binterval%5D=month&unit_amount=4999",
        "body_type": "text",
        "headers": {
          "accept-encoding": [
            "gzip"
          ],
          "content-type": [
            "application/x-www-form-urlencoded"
          ],
          "user-agent": [
            "req/0.5.17"
          ]
        },
        "method": "POST",
        "query_string": "",
        "uri": "https://api.stripe.com/v1/prices"
      },
      "response": {
        "body_json": {
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1775491385,
          "currency": "usd",
          "custom_unit_amount": null,
          "id": "price_1TJFcDGkgiYxMEom0aE1WSjF",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "object": "price",
          "product": "prod_UHpGo8INwka9QU",
          "recurring": {
            "interval": "month",
            "interval_count": 1,
            "meter": null,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 4999,
          "unit_amount_decimal": "4999"
        },
        "body_type": "json",
        "headers": {
          "access-control-allow-credentials": [
            "true"
          ],
          "access-control-allow-methods": [
            "GET, HEAD, PUT, PATCH, POST, DELETE"
          ],
          "access-control-allow-origin": [
            "*"
          ],
          "access-control-expose-headers": [
            "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
          ],
          "access-control-max-age": [
            "300"
          ],
          "cache-control": [
            "no-cache, no-store"
          ],
          "connection": [
            "keep-alive"
          ],
          "content-security-policy": [
            "base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src 'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD"
          ],
          "content-type": [
            "application/json"
          ],
          "date": [
            "Mon, 06 Apr 2026 16:03:05 GMT"
          ],
          "idempotency-key": [
            "6fa4720e-d8d3-4007-911a-abb642c406ab"
          ],
          "original-request": [
            "req_AqneQfpfzrxVZi"
          ],
          "report-to": [
            "{\"group\":\"csp\",\"max_age\":8640,\"endpoints\":[{\"url\":\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\"}],\"include_subdomains\":true}"
          ],
          "reporting-endpoints": [
            "csp=\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\""
          ],
          "request-id": [
            "req_AqneQfpfzrxVZi"
          ],
          "server": [
            "nginx"
          ],
          "strict-transport-security": [
            "max-age=63072000; includeSubDomains; preload"
          ],
          "stripe-should-retry": [
            "false"
          ],
          "stripe-version": [
            "2026-02-25.clover"
          ],
          "vary": [
            "Origin"
          ],
          "x-stripe-priority-routing-enabled": [
            "true"
          ],
          "x-stripe-routing-context-priority-tier": [
            "api-testmode"
          ],
          "x-wc": [
            "3c3"
          ]
        },
        "status": 200
      }
    },
    {
      "recorded_at": "2026-04-06T16:03:06.745402Z",
      "request": {
        "body": "cancel_url=https%3A%2F%2Fexample.com%2Freturn%3Fcancelled%3Dtrue&line_items%5B0%5D%5Bprice%5D=price_1TJFcDGkgiYxMEom0aE1WSjF&line_items%5B0%5D%5Bquantity%5D=1&mode=subscription&success_url=https%3A%2F%2Fexample.com%2Freturn%3Fsuccess%3Dtrue%26session_id%3D%7BCHECKOUT_SESSION_ID%7D",
        "body_type": "text",
        "headers": {
          "accept-encoding": [
            "gzip"
          ],
          "content-type": [
            "application/x-www-form-urlencoded"
          ],
          "user-agent": [
            "req/0.5.17"
          ]
        },
        "method": "POST",
        "query_string": "",
        "uri": "https://api.stripe.com/v1/checkout/sessions"
      },
      "response": {
        "body_json": {
          "success_url": "https://example.com/return?success=true&session_id={CHECKOUT_SESSION_ID}",
          "allow_promotion_codes": null,
          "consent_collection": null,
          "mode": "subscription",
          "currency_conversion": null,
          "ui_mode": "hosted",
          "origin_context": null,
          "shipping_cost": null,
          "livemode": false,
          "customer": null,
          "billing_address_collection": null,
          "setup_intent": null,
          "after_expiration": null,
          "integration_identifier": null,
          "created": 1775491386,
          "consent": null,
          "payment_intent": null,
          "expires_at": 1775577786,
          "customer_creation": "always",
          "customer_details": null,
          "invoice": null,
          "wallet_options": null,
          "status": "open",
          "payment_link": null,
          "amount_total": 4999,
          "id": "cs_test_a1IUP9V2GsIeGoHeiMsQfHnvIEulVZj6tLxo9MlglfeWHGcFjvFmKbs7jT",
          "customer_account": null,
          "cancel_url": "https://example.com/return?cancelled=true",
          "automatic_tax": {
            "enabled": false,
            "liability": null,
            "provider": null,
            "status": null
          },
          "adaptive_pricing": {
            "enabled": true
          },
          "phone_number_collection": {
            "enabled": false
          },
          "invoice_creation": null,
          "payment_method_options": {
            "card": {
              "request_three_d_secure": "automatic"
            }
          },
          "currency": "usd",
          "url": "https://checkout.stripe.com/c/pay/cs_test_a1IUP9V2GsIeGoHeiMsQfHnvIEulVZj6tLxo9MlglfeWHGcFjvFmKbs7jT#fidnandhYHdWcXxpYCc%2FJ2FgY2RwaXEnKSdkdWxOYHwnPyd1blpxYHZxWjA0UUxwdTVCbmJsXH1IQGpoN29XcVRAMl1fbT1JaExxYFdSb1RcPVBTbWpKSW42VDZkNF9sSUQzfW01Zk9nQ2ZkdHBxSTJzNUJ8YFxhdmJDcEN1MTwzN0dPNTVJamB8RmloYScpJ2N3amhWYHdzYHcnP3F3cGApJ2dkZm5id2pwa2FGamlqdyc%2FJyZjY2NjY2MnKSdpZHxqcHFRfHVgJz8ndmxrYmlgWmxxYGgnKSdga2RnaWBVaWRmYG1qaWFgd3YnP3F3cGB4JSUl",
          "object": "checkout.session",
          "payment_method_collection": "always",
          "client_secret": null,
          "discounts": [],
          "payment_method_types": [
            "card",
            "klarna",
            "link",
            "cashapp",
            "amazon_pay"
          ],
          "permissions": null,
          "saved_payment_method_options": {
            "allow_redisplay_filters": [
              "always"
            ],
            "payment_method_remove": "disabled",
            "payment_method_save": null
          },
          "client_reference_id": null,
          "customer_email": null,
          "collected_information": null,
          "recovered_from": null,
          "total_details": {
            "amount_discount": 0,
            "amount_shipping": 0,
            "amount_tax": 0
          },
          "locale": null,
          "shipping_options": [],
          "subscription": null,
          "amount_subtotal": 4999,
          "payment_status": "unpaid",
          "custom_fields": [],
          "metadata": {},
          "custom_text": {
            "after_submit": null,
            "shipping_address": null,
            "submit": null,
            "terms_of_service_acceptance": null
          },
          "shipping_address_collection": null,
          "branding_settings": {
            "background_color": "#ffffff",
            "border_style": "rounded",
            "button_color": "#0074d4",
            "display_name": "Metric Flow",
            "font_family": "default",
            "icon": null,
            "logo": null
          },
          "submit_type": null,
          "payment_method_configuration_details": {
            "id": "pmc_1TIup9GkgiYxMEomuWW0EmIG",
            "parent": null
          }
        },
        "body_type": "json",
        "headers": {
          "access-control-allow-credentials": [
            "true"
          ],
          "access-control-allow-methods": [
            "GET, HEAD, PUT, PATCH, POST, DELETE"
          ],
          "access-control-allow-origin": [
            "*"
          ],
          "access-control-expose-headers": [
            "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
          ],
          "access-control-max-age": [
            "300"
          ],
          "cache-control": [
            "no-cache, no-store"
          ],
          "connection": [
            "keep-alive"
          ],
          "content-security-policy": [
            "base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src 'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD"
          ],
          "content-type": [
            "application/json"
          ],
          "date": [
            "Mon, 06 Apr 2026 16:03:06 GMT"
          ],
          "idempotency-key": [
            "64cf8457-b12d-45af-806f-e9ee62c7af4b"
          ],
          "original-request": [
            "req_egn8DZQwpZOVrj"
          ],
          "report-to": [
            "{\"group\":\"csp\",\"max_age\":8640,\"endpoints\":[{\"url\":\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\"}],\"include_subdomains\":true}"
          ],
          "reporting-endpoints": [
            "csp=\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\""
          ],
          "request-id": [
            "req_egn8DZQwpZOVrj"
          ],
          "server": [
            "nginx"
          ],
          "strict-transport-security": [
            "max-age=63072000; includeSubDomains; preload"
          ],
          "stripe-should-retry": [
            "false"
          ],
          "stripe-version": [
            "2026-02-25.clover"
          ],
          "vary": [
            "Origin"
          ],
          "x-stripe-priority-routing-enabled": [
            "true"
          ],
          "x-stripe-routing-context-priority-tier": [
            "api-testmode"
          ],
          "x-wc": [
            "3c3"
          ]
        },
        "status": 200
      }
    }
  ],
  "version": "2.0"
}