test/cassettes/billing/create_price.json

{
  "interactions": [
    {
      "recorded_at": "2026-04-06T16:03:07.994664Z",
      "request": {
        "body": "name=Price+Test+Product&type=service",
        "body_type": "text",
        "headers": {
          "accept-encoding": [
            "gzip"
          ],
          "content-type": [
            "application/x-www-form-urlencoded"
          ],
          "user-agent": [
            "req/0.5.17"
          ]
        },
        "method": "POST",
        "query_string": "",
        "uri": "https://api.stripe.com/v1/products"
      },
      "response": {
        "body_json": {
          "active": true,
          "attributes": [],
          "created": 1775491387,
          "default_price": null,
          "description": null,
          "id": "prod_UHpG3lvSG97Mxn",
          "images": [],
          "livemode": false,
          "marketing_features": [],
          "metadata": {},
          "name": "Price Test Product",
          "object": "product",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "tax_details": null,
          "type": "service",
          "unit_label": null,
          "updated": 1775491387,
          "url": null
        },
        "body_type": "json",
        "headers": {
          "access-control-allow-credentials": [
            "true"
          ],
          "access-control-allow-methods": [
            "GET, HEAD, PUT, PATCH, POST, DELETE"
          ],
          "access-control-allow-origin": [
            "*"
          ],
          "access-control-expose-headers": [
            "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
          ],
          "access-control-max-age": [
            "300"
          ],
          "cache-control": [
            "no-cache, no-store"
          ],
          "connection": [
            "keep-alive"
          ],
          "content-security-policy": [
            "base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src 'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD"
          ],
          "content-type": [
            "application/json"
          ],
          "date": [
            "Mon, 06 Apr 2026 16:03:08 GMT"
          ],
          "idempotency-key": [
            "d6a00a7a-71a8-4c62-a54f-84e57c897f34"
          ],
          "original-request": [
            "req_ZuHwPPwfjdIfBF"
          ],
          "report-to": [
            "{\"group\":\"csp\",\"max_age\":8640,\"endpoints\":[{\"url\":\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\"}],\"include_subdomains\":true}"
          ],
          "reporting-endpoints": [
            "csp=\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\""
          ],
          "request-id": [
            "req_ZuHwPPwfjdIfBF"
          ],
          "server": [
            "nginx"
          ],
          "strict-transport-security": [
            "max-age=63072000; includeSubDomains; preload"
          ],
          "stripe-should-retry": [
            "false"
          ],
          "stripe-version": [
            "2026-02-25.clover"
          ],
          "vary": [
            "Origin"
          ],
          "x-stripe-priority-routing-enabled": [
            "true"
          ],
          "x-stripe-routing-context-priority-tier": [
            "api-testmode"
          ],
          "x-wc": [
            "3c3"
          ]
        },
        "status": 200
      }
    },
    {
      "recorded_at": "2026-04-06T16:03:08.234842Z",
      "request": {
        "body": "currency=usd&product=prod_UHpG3lvSG97Mxn&recurring%5Binterval%5D=month&unit_amount=2999",
        "body_type": "text",
        "headers": {
          "accept-encoding": [
            "gzip"
          ],
          "content-type": [
            "application/x-www-form-urlencoded"
          ],
          "user-agent": [
            "req/0.5.17"
          ]
        },
        "method": "POST",
        "query_string": "",
        "uri": "https://api.stripe.com/v1/prices"
      },
      "response": {
        "body_json": {
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1775491388,
          "currency": "usd",
          "custom_unit_amount": null,
          "id": "price_1TJFcGGkgiYxMEomZjXXswop",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "object": "price",
          "product": "prod_UHpG3lvSG97Mxn",
          "recurring": {
            "interval": "month",
            "interval_count": 1,
            "meter": null,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 2999,
          "unit_amount_decimal": "2999"
        },
        "body_type": "json",
        "headers": {
          "access-control-allow-credentials": [
            "true"
          ],
          "access-control-allow-methods": [
            "GET, HEAD, PUT, PATCH, POST, DELETE"
          ],
          "access-control-allow-origin": [
            "*"
          ],
          "access-control-expose-headers": [
            "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
          ],
          "access-control-max-age": [
            "300"
          ],
          "cache-control": [
            "no-cache, no-store"
          ],
          "connection": [
            "keep-alive"
          ],
          "content-security-policy": [
            "base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src 'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD"
          ],
          "content-type": [
            "application/json"
          ],
          "date": [
            "Mon, 06 Apr 2026 16:03:08 GMT"
          ],
          "idempotency-key": [
            "1e05f819-68ff-41ff-894a-0b7ee5d6a90f"
          ],
          "original-request": [
            "req_QUOzPRlcesvNK7"
          ],
          "report-to": [
            "{\"group\":\"csp\",\"max_age\":8640,\"endpoints\":[{\"url\":\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\"}],\"include_subdomains\":true}"
          ],
          "reporting-endpoints": [
            "csp=\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\""
          ],
          "request-id": [
            "req_QUOzPRlcesvNK7"
          ],
          "server": [
            "nginx"
          ],
          "strict-transport-security": [
            "max-age=63072000; includeSubDomains; preload"
          ],
          "stripe-should-retry": [
            "false"
          ],
          "stripe-version": [
            "2026-02-25.clover"
          ],
          "vary": [
            "Origin"
          ],
          "x-stripe-priority-routing-enabled": [
            "true"
          ],
          "x-stripe-routing-context-priority-tier": [
            "api-testmode"
          ],
          "x-wc": [
            "3c3"
          ]
        },
        "status": 200
      }
    }
  ],
  "version": "2.0"
}