test/cassettes/billing/create_price_error.json

{
  "interactions": [
    {
      "recorded_at": "2026-04-06T16:03:08.552583Z",
      "request": {
        "body": "currency=usd&product=prod_nonexistent&recurring%5Binterval%5D=month&unit_amount=0",
        "body_type": "text",
        "headers": {
          "accept-encoding": [
            "gzip"
          ],
          "content-type": [
            "application/x-www-form-urlencoded"
          ],
          "user-agent": [
            "req/0.5.17"
          ]
        },
        "method": "POST",
        "query_string": "",
        "uri": "https://api.stripe.com/v1/prices"
      },
      "response": {
        "body_json": {
          "error": {
            "code": "resource_missing",
            "doc_url": "https://stripe.com/docs/error-codes/resource-missing",
            "message": "No such product: 'prod_nonexistent'",
            "param": "product",
            "request_log_url": "https://dashboard.stripe.com/acct_1TIup0GkgiYxMEom/test/workbench/logs?object=req_CxwfvIOSK799GL",
            "type": "invalid_request_error"
          }
        },
        "body_type": "json",
        "headers": {
          "access-control-allow-credentials": [
            "true"
          ],
          "access-control-allow-methods": [
            "GET, HEAD, PUT, PATCH, POST, DELETE"
          ],
          "access-control-allow-origin": [
            "*"
          ],
          "access-control-expose-headers": [
            "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
          ],
          "access-control-max-age": [
            "300"
          ],
          "cache-control": [
            "no-cache, no-store"
          ],
          "connection": [
            "keep-alive"
          ],
          "content-security-policy": [
            "base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src 'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD"
          ],
          "content-type": [
            "application/json"
          ],
          "date": [
            "Mon, 06 Apr 2026 16:03:08 GMT"
          ],
          "idempotency-key": [
            "64106bff-591d-4dcf-b57f-d1ec9add1100"
          ],
          "original-request": [
            "req_CxwfvIOSK799GL"
          ],
          "report-to": [
            "{\"group\":\"csp\",\"max_age\":8640,\"endpoints\":[{\"url\":\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\"}],\"include_subdomains\":true}"
          ],
          "reporting-endpoints": [
            "csp=\"https://q.stripe.com/csp-report-v2?q=XYFtt7teLfDUiEsWcwlPNh1mafuTwG50agGa-zL86b4Oyn8ovKHhffOIVdBS1gXg6itSly31QHXvThFD&t=1\""
          ],
          "request-id": [
            "req_CxwfvIOSK799GL"
          ],
          "server": [
            "nginx"
          ],
          "strict-transport-security": [
            "max-age=63072000; includeSubDomains; preload"
          ],
          "stripe-version": [
            "2026-02-25.clover"
          ],
          "vary": [
            "Origin"
          ],
          "x-stripe-priority-routing-enabled": [
            "true"
          ],
          "x-stripe-routing-context-priority-tier": [
            "api-testmode"
          ],
          "x-wc": [
            "3c3"
          ]
        },
        "status": 400
      }
    }
  ],
  "version": "2.0"
}